~Cases/SpeciesTransport/simpleMixing/LTS_Mixing_reactingFoam/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/fluid_0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.004;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    inlet_air
    {
        type            fixedValue;
        value           uniform 0.004;
    }
	
    inlet_top
    {
        type            fixedValue;
        value           uniform 0.389;
    }

    inlet_bottom
    {
        type            kqRWallFunction;
        value           $internalField; 
    }
	
    outlet
    {
        type            zeroGradient;
    }

    "wall.*"
    {
        type            kqRWallFunction;
        value           $internalField; 
    }

    symmetry
    {
	type            symmetry;  
    }
	
    frontAndBackPlanes
    {
        type            empty;
    }
	
    "proc.*"
    {
        type            processor;
    }	
}
