~Cases/SpeciesTransport/simpleMixing/LTS_Mixing_reactingFoam/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0030;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet_air
    {
        type            calculated;
        value           $internalField;
    }

    inlet_top
    {
        type            calculated;
        value           $internalField;
    }

    inlet_bottom
    {
        type            nutkWallFunction;
	    value		$internalField;
    }   

    outlet
    {
        type            zeroGradient;
    }

    "wall.*"
    {
        type            nutkWallFunction;
	    value		$internalField;
    } 

    symmetry
    {
	    type            symmetry;  
    }
	
    frontAndBackPlanes
    {
        type            empty;
    }
	
    "proc.*"
    {
        type            processor;
    }	
}


// ************************************************************************* //
