~Cases/SpeciesTransport/simpleMixing/LTS_Mixing_reactingFoam/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/fluid_0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10;

boundaryField
{

    #includeEtc "caseDicts/setConstraintTypes"
    inlet_air
    {
        type            fixedValue;
        value           uniform 1.46;
    }
    
    inlet_top
    {
        type            fixedValue;
        value           uniform 175;
    }
    
    inlet_bottom
    {
        type            omegaWallFunction;
        value           $internalField; 
    }
	
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 5;
        value           $internalField; 
    }

    "wall.*"
    {
        type            omegaWallFunction;
        value           $internalField; 
    }
	
	
    frontAndBackPlanes
    {
        type            empty;
    }

    symmetry
    {
	type            symmetry;  
    }
	
    "proc.*"
    {
        type            processor;
    }	
}

